Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་སྣང་བར་བྱས་ཏེ། འཇིག་རྟེན་ལན་བཅུར་བསྐོར་བ་བྱས་ནས། སྟེང་གི་ནམ་མཁའི་དབྱིངས་ལ་འདུག་སྟེ། འོད་གཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་དུ་བྱས་ནས། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ཅིང་རིམ་གྲོ་བྱ་བ་འོད་ཤིན་ཏུ་གསལ་བ་ཞེས་བྱ་བ་རབ་ཏུ་བྱེད་དེ།
en: They radiate toward and reach and illuminate in the ten directions all those in the assemblies of followers of tathāgatas, circle the worlds clockwise ten times, and then stay in the sky above the world, where they form a great circular network of light rays and perform a vast offering and service called intensely bright light to the tathāgatas.

source: མཆོད་པ་དང་རིམ་གྲོ་དེ་ལ་སེམས་དང་པོ་བསྐྱེད་པ་ཉེ་བར་བཟུང་བ་ཡན་ཅད་ས་དགུ་པ་ཐོབ་ཀྱི་བར་དུ་དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོ་བྱས་པས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: The offerings and service that are made by bodhisattvas from the first development of bodhicitta until the attainment of the ninth bhūmi do not equal even a hundredth of that offering and service.

source: །སྟོང་གི་ཆ་དང་བརྒྱ་སྟོང་གི་ཆ་དང་། ཁྲག་ཁྲིག་གི་ཆ་དང་། ཁྲག་ཁྲིག་བརྒྱའི་ཆ་དང་། ཁྲག་ཁྲིག་སྟོང་གི་ཆ་དང་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མྱི་འགྲོའོ།
en: They do not equal even a thousandth, a hundred thousandth, a ten millionth, a billionth, a ten billionth, a trillionth, or even a quintillionth of it.

source: །གྲངས་དང་ཆ་དང་། བགྲང་བ་དང་རྒྱུར་ཡང་ཉེ་བར་མྱི་འགྲོ་བ་ནས་བསྒྲུན་པ་ཙམ་གྱི་བར་དུའང་མྱི་ཆོག་གོ །འོད་གཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་ཆེན་པོ་དེ་ལས་ཕྱོགས་བཅུ་ན་མེ་ཏོག་དུ་གདགས་པ་དང་། སྤོས་དང་། བདུག་པ་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རིན་པོ་ཆེའི་རྒྱན་དང་། ནོར་བུ་རིན་པོ་ཆེར་གདགས་པ་ཅི་ཡོད་པ་དེ་དག་ཐམས་ཅད་ལས་ལྷག་ཅིང་འཇིག་རྟེན་གྱི་ཡུལ་ཐམས་ཅད་ལས་འདས་ལ་འཇིག་རྟེན་ལས་འདས་པའི་དགེ་བའི་རྩ་བའི་དབང་གིས་གྲུབ་པ་དག་སྤྲིན་ཆེན་པོའི་ཆར་བཞིན་དུ་མངོན་པར་འབབ་བོ། །མཆོད་པ་དེ་དག་སེམས་ཅན་གང་གིས་མཐོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་རོ།
en: They cannot be correlated to it through numbers, enumeration, comparison, resemblance, or similitude. “From the great circular network of light there come forth as many flowers as are known in the ten directions, along with all known scents, incense, garlands, perfumes, ointments, powders, monastic robes, parasols, banners, flags, clothing, jewelry, and precious jewels, which are in overabundance, transcend what is known in the world, are created from possessing an accumulation of transcendent roots of goodness, have the perfection of every kind of good quality, are empowered by the inconceivable power of emanation, are a great rain of a display of various riches, and are like great clouds that rain down onto each assembly of the followers of the tathāgatas. The beings who perceive these offerings will definitely attain complete enlightenment.

source: །མཆོད་པ་དང་། རིམ་གྲོའི་རྣམ་པ་དེ་ལྟ་བུ་དག་བྱས་ནས་ཀྱང་འོད་གཟེར་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་སྣང་བར་བྱས་ནས། འཇིག་རྟེན་ལན་བཅུར་བསྐོར་བ་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཞབས་ཀྱི་མཐིལ་གྱི་འོག་ཏུ་ནུབ་པར་གྱུར་ཏེ།
en: After the light rays have created that kind of offering and service, they again illuminate all the assemblies of followers of the tathāgatas, circle the worlds clockwise ten times, and vanish into the soles of the feet of the tathāgata arhat samyak­sambuddhas.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཆེ་གེ་མོ་ཞིག་ཏུ་དེ་ལྟ་བུའི་སྤྱོད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བའི་དུས་ལ་བབ་པར་ཐུགས་སུ་ཆུད་དོ།
en: “Then those tathāgatas and bodhisattvas know that in such a universe there is a bodhisattva with that kind of conduct whose time for consecration has come. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེར་ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་ལ་གནས་པའི་བར་གྱི་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་པ་འོངས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ཀུན་ནས་བསྐོར་ནས།
en: Then infinite bodhisattvas up to those on the ninth bhūmi come from countless universes in the ten directions, assemble around that bodhisattva, and make great offerings to him, and while gazing upon that bodhisattva, they attain a million samādhis.

source: མཆོད་པ་ཆེན་པོ་བྱས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཉིད་ལ་ལྟ་ཞིང་ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བཅུ་བཅུ་ལ་སོ་སོ་ནས་མཉམ་པར་གཞོག་གོ །བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བའི་ས་ཐོབ་པ་རྣམས་ཀྱི་དཔལ་གྱི་བེའུ་དང་རྡོ་རྗེ་དང་། བཀྲ་ཤིས་ལས་བདུད་ཀྱི་དགྲ་ལས་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བའི་འོད་གཟེར་ཆེན་པོ་གཅིག །འོད་གཟེར་གྱི་འཁོར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་དང་ལྡན་པ་འབྱུང་སྟེ།
en: “From the śrīvatsa adornment, the vajra-svastika, on each of the bodies of the bodhisattvas who have reached the bhūmi of consecration, there comes a great light ray called victory over all māra enemies , accompanied by countless millions of light rays.

source: བྱུང་ནས་ཀྱང་ཕྱོགས་བཅུར་སྣང་བར་བྱས་ནས་ཆོ་འཕྲུལ་མུ་མེད་པ་ཡང་དག་པར་བསྟན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེའི་དཔལ་གྱི་བེའུ་དང་། རྡོ་རྗེ་དང་བཀྲ་ཤིས་སུ་ནུབ་པར་འགྱུར་རོ།
en: They radiate toward and illuminate the ten directions, manifest endless miracles, and then vanish into the bodhisattva’s śrīvatsa adornment, his vajra-svastika.

source: །འོད་གཟེར་དེ་དག་དེར་ནུབ་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་སྟོབས་དང་། མཐུ་ཡང་བརྒྱ་ཕྲག་སྟོང་གྱུར་པས་ཀྱང་ལྷག་པར་མངོན་པར་འཕེལ་བར་སྣང་ངོ་།
en: Simultaneous with the vanishing of those light rays, the power and might of that bodhisattva is perceived to increase more than a hundred thousand times.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་ཐམས་ཅད་མཁྱེན་པའི་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་འོད་ཟེར་འོད་གཟེར་གྱི་འཁོར་གྲངས་མེད་པ་དང་ལྡན་པ་འབྱུང་སྟེ།
en: “O jinaputras! Then the ūrṇā hairs of the tathāgata arhat samyak­sambuddhas radiate light rays called endowed with omniscient clairvoyance , accompanied by countless light rays.

source: དེ་དག་གིས་ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་མ་ལུས་པར་སྣང་བར་བྱས་ནས། འཇིག་རྟེན་ལན་བཅུར་བསྐོར་ཏེ། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་བསྟན་ནས། བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོ་ཡང་དག་པར་བསྐུལ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་རྣམ་པ་དྲུག་ཏུ་བསྐྱོད་དེ། ངན་སོང་ཐམས་ཅད་ཀྱི་ལམ་གྱི་རྒྱུད་དང་སྐྱེ་བ་དང་། ཤི་འཕོ་རབ་ཏུ་ཞི་བར་བྱས་ནས་བདུད་ཀྱི་གནས་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་པར་འཚང་རྒྱ་བ་རྣམ་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་གདན་ཡང་དག་པར་བསྟན་ནས། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་བརྒྱན་པའི་མཐུ་རབ་ཏུ་བསྟན་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ།
en: They illuminate every single world in all ten directions, circle the worlds clockwise ten times, manifest the great miraculous transformations of the tathāgatas, inspire many quintillions of bodhisattvas, cause all the vast extent of buddha realms to tremble in six ways, end all falling into rebirth in the lower existences, darken all the abodes of the māras, reveal all the buddha thrones upon which the tathāgatas become enlightened and attain buddhahood, reveal the majesty of the array of assemblies of the followers of all buddhas, and illuminate all worlds throughout the realm of phenomena as far as the ends of space.

source: ནམ་མཁའི་མཐས་གཏུགས་པ་ཐམས་ཅད་སྣང་བར་བྱས་ནས། ཕྱིར་ལོག་སྟེ། བྱང་ཆུབ་སེམས་པས་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱི་སྟེང་ནས་བསྐོར་བ་བྱས་ཏེ། རྒྱན་ཆེན་པོ་བསྟན་ནས། འོད་གཟེར་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཡན་ལག་གི་དམ་པར་ནུབ་པོ།
en: Then the light rays return, circle clockwise above all the gathered assemblies of bodhisattvas, reveal a great display, and vanish into the head of the bodhisattva.

source: །དེའི་འཁོར་གྱི་འོད་གཟེར་རྣམས་ཀྱང་དེ་ལྟར་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མགོར་ནུབ་པར་འགྱུར་རོ།
en: The accompanying light rays disappear into the heads of the assembled bodhisattvas.

source: །འོད་གཟེར་དེ་དག་གིས་ཕོག་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་སྔན་ཅད་མ་ཐོབ་པའི་ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བཅུ་བཅུ་རབ་ཏུ་འཐོབ་བོ།
en: Simultaneous with the descent of those light rays, the bodhisattvas attain ten thousand previously unattained samādhis.

source: །འོད་གཟེར་དེ་དག་ཀྱང་དུས་གཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཡན་ལག་དམ་པ་ལ་འཆར་བར་འགྱུར་ཏེ།
en: At the same time, the light rays descend into the head of the bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་མངོན་པར་དབང་བསྐུར་ཞེས་བྱའོ།
en: That bodhisattva is then said to be consecrated in the field of the samyak­sambuddhas.

source: །སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་ནས་ནི། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་བགྲང་བ་ཡང་འཐོབ་པར་འགྱུར་རོ།
en: His ten strengths are completed, and he is numbered among the samyak­sambuddhas. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་དཔེར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བུ་ཐུ་བོ་གཞོན་ནུ་བཙུན་མོ་དམ་པ་ལས་བཙས་པ།
en: To give an analogy, it is like the crown prince of a cakravartin, who is born from the principal queen and endowed with the features of a cakravartin king.

source: རྒྱལ་པོའི་མཚན་དང་ལྡན་པ་དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་ལྷའི་གླང་པོ་རིན་པོ་ཆེ་ལ་གསེར་གྱི་ཁྲི་དམ་པའི་སྟེང་དུ་བཞག་སྟེ།
en: The cakravartin enthrones him upon a sublime golden throne atop a divine elephant.

source: སྟེང་ནས་བླ་རེ་བྲེས་ཤིང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རོལ་མོ་བཅུད་པ་དང་། དཀྲོལ་པ་དང་། གླུའི་དབྱངས་ལ་སོགས་པའི་རྒྱན་ཆེན་པོ་བྱས་ཏེ།
en: There is arranged a canopy above him, and a great arrangement of banners, flags, and the playing of music.

source: རྒྱ་མཚོ་ཆེན་པོ་བཞི་ལས་ཆུ་བླངས་པ་གསེར་གྱི་བུམ་པས་བཅུས་ཏེ། ཆུ་ངེས་གཞོན་ནུ་དེའི་སྦྱི་བོ་ནས་མངོན་པར་དབང་བསྐུར་ནས།
en: Water is brought from the four great oceans and poured into a golden vase, and that water is sprinkled on the head of the prince.

source: དབང་བསྐུར་མ་ཐག་ཏུ་དེ་ནི་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ།
en: As soon as he is sprinkled, he is numbered among those who are consecrated kṣatriya kings.

source: །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་ནས་ནི་འཁོར་ལོས་སྒྱུར་བར་བགྲང་བ་རབ་ཏུ་འཐོབ་བོ།
en: Then when he has accomplished the path of the ten good actions, he becomes recognized as a cakravartin.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་དབང་བསྐུར་མ་ཐག་ཏུ། ཡེ་ཤེས་ཀྱི་དབང་མངོན་པར་བསྐུར་བས་མངོན་པར་དབང་བསྐུར་བ་ཞེས་བྱའོ།
en: “O jinaputras! In the same way, as soon as the bodhisattva is consecrated by the buddha bhagavats, he is consecrated by the consecration of great wisdom.

source: །སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་ནས་ནི། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་གྲངས་སུ་འགྲོའོ།
en: When the one consecrated by the samyak­sambuddhas perfects the ten strengths, he becomes numbered among the samyak­sambuddhas.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི།
en: “O jinaputras!

source: གང་གི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དཀའ་བ་བརྒྱ་སྟོང་དུ་མ་རྩོམ་པའི་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་དབང་བསྐུར་བའོ།
en: A bodhisattva undertakes a hundred thousand hardships for the sake of the bodhisattva’s consecration of great wisdom.

source: །དེ་དེ་ལྟར་མངོན་པར་དབང་བསྐུར་ཞིང་ཡོན་ཏན་དང་ཡེ་ཤེས་རྣམ་པར་འཕེལ་བ་ནི། བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་ལ་གནས་པ་ཞེས་བྱའོ།
en: The one who has been consecrated in this way and whose qualities and wisdom have increased immeasurably is said to be someone who is on the bodhisattva bhūmi Cloud of Dharma.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཀྱི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །འདོད་པའི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། གཟུགས་ཀྱི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། གཟུགས་མེད་པའི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། ནམ་མཁའི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། ཡང་དག་པ་དང་ཡང་དག་པ་མ་ཡིན་པའི་ཁམས་བསྟན་པ་ཡང་དག་པར་བསྒྲུབ་པ་དང་། མྱ་ངན་ལས་འདས་པའི་ཁམས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། ལྟ་བའི་རྣམ་པ་དང་ཉོན་མོངས་པ་ཡང་དག་པར་བསྒྲུབ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “O jinaputras! The bodhisattva who is on the bodhisattva bhūmi Cloud of Dharma knows correctly how the realm of phenomena is arrived at, how the realm of desire is arrived at, how the realm of form is arrived at, how the realm of formlessness is arrived at, how the realms of beings are arrived at, how the realms of consciousness are arrived at, how the realms that are composite and noncomposite are arrived at, how the realm of space is arrived at, how the realms of valid and invalid teaching are arrived at, how the realm of nirvāṇa is arrived at, and how the kleśas formed by views are arrived at.

source: །འཇིག་རྟེན་གྱི་ཁམས་འཇིག་པ་དང་འདུ་བ་ཡང་དག་པར་བསྒྲུབ་པ་དང་། ཉན་ཐོས་ཀྱི་སྤྱོད་པ་ཡང་དག་པར་བསྒྲུབ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་སྤྱོད་པ་ཡང་དག་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་དག་པར་བསྒྲུབ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་། གཟུགས་ཀྱི་སྐུ་དང་། ཆོས་ཀྱི་སྐུ་ཡང་དག་པར་བསྒྲུབ་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། བཟློག་པ་བསྟན་པ་ཡང་དག་པར་བསྒྲུབ་པ་དང་། མདོར་བསྡུ་ན་ཆོས་ཐམས་ཅད་རྣམ་པར་ཕྱེ་བ་ལ་འཇུག་ཅིང་ཤིན་ཏུ་བརྟག་པ་ཡང་དག་པར་བསྒྲུབ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “He knows correctly how the formation and dissolution of worlds is arrived at, he knows correctly how śrāvaka conduct is arrived at, he knows correctly how pratyekabuddha conduct is arrived at, he knows correctly how bodhisattva conduct is arrived at, he knows correctly how the strengths, confidences, rūpakāya, and dharmakāya of the tathāgatas are arrived at, he knows correctly how complete omniscient wisdom is arrived at, and he knows correctly how displaying complete buddhahood and turning the Dharma wheel is arrived at. In brief, he knows correctly the comprehension, analysis, and completion of all phenomena.

source: །དེ་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པའི་བློས་གོང་དུ་སེམས་ཅན་རྣམས་ཀྱི་སྤྲུལ་པའི་ལས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “Having the realization that has attained that kind of wisdom, he knows perfectly the emanations as the bodies of beings;

source: །ཉོན་མོངས་པའི་སྤྲུལ་པ་དང་། ལྟ་བའི་རྣམ་པའི་སྤྲུལ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྤྲུལ་པ་དང་། ཆོས་ཀྱི་ཁམས་ཀྱི་སྤྲུལ་པ་དང་། ཉན་ཐོས་ཀྱི་སྤྲུལ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྲུལ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་དང་། སྤྲུལ་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་དགོད་པ་དང་། རྣམ་པར་མི་དགོད་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །དེ་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: he knows perfectly the emanations created by the kleśas, the emanations that create views, the emanations as worlds, the emanations as the realm of phenomena, the emanations as śrāvakas, the emanations as pratyekabuddhas, the emanations as bodhisattvas, the emanations as tathāgatas, and the appropriateness and inappropriateness of all emanations.

source: །ཆོས་ཀྱི་བྱིན་གྱི་རླབས་དང་། དགེ་འདུན་གྱི་བྱིན་གྱི་རླབས་དང་། ལས་ཀྱི་བྱིན་གྱི་རླབས་དང་། ཉོན་མོངས་པའི་བྱིན་གྱི་རླབས་དང་། དུས་ཀྱི་བྱིན་གྱི་རླབས་དང་། སྨོན་ལམ་གྱི་བྱིན་གྱི་རླབས་དང་། མཆོད་པའི་བྱིན་གྱི་རླབས་དང་། སྤྱོད་པའི་བྱིན་གྱི་རླབས་དང་། བསྐལ་པའི་བྱིན་གྱི་རླབས་དང་། ཡེ་ཤེས་ཀྱི་བྱིན་གྱི་རླབས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །གང་འདི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་འདི་ལྟ་སྟེ། སྤྱོད་པ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། སྐྱེ་བ་དང་འཕོ་བ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། སྐུ་ཚེ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ།
en: “He also knows correctly the basis of the buddhas, the basis of the Dharma, the basis of the Saṅgha, the basis of karma, the basis of the kleśas, the basis of time, the basis of prayer, the basis of offering, the basis of conduct, the basis of eons, and the basis of wisdom.

source: མངོན་པར་འབྱུང་བ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ།
en: “He knows correctly the wisdoms of the tathāgata arhat samyak­sambuddhas that comprehend subtleties:

source: མངོན་པར་བྱང་ཆུབ་བ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། རྣམ་པར་འཕྲུལ་པ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། སྐུ་ཚེའི་ཚད་བྱིན་གྱི་རླབས་པ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ།
en: the wisdom that comprehends the subtleties of conduct, the wisdom that comprehends the subtleties of passing away and rebirth, the wisdom that comprehends the subtleties of birth, the wisdom that comprehends the subtleties of renunciation, the wisdom that comprehends the subtleties of enlightenment, the wisdom that comprehends the subtleties of miracles, the wisdom that comprehends the subtleties of turning the wheel of Dharma, the wisdom that comprehends the subtleties of power over one’s lifespan, the wisdom that comprehends the subtleties of passing into nirvāṇa, and the wisdom that comprehends the subtleties of the presence of the teachings.

source: བསྟན་པ་གནས་པ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་དེ་དག་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེས་རབ་ཏུ་ཤེས་སོ། །གང་འདི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་གསང་བ་ལ་འཇུག་པའི་གནས་འདི་ལྟ་སྟེ། སྐུའི་གསང་བ་འམ། གསུང་གི་གསང་བ་འམ། ཐུགས་ཀྱི་གསང་བ་འམ།
en: “He has the correct knowledge of the secrets of the tathāgata arhat samyak­sambuddhas:

source: དུས་དང་དུས་མ་ཡིན་པ་ཐུགས་སུ་ཆུད་པའི་གསང་བ་འམ། བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་པའི་གསང་བ་འམ། སེམས་ཅན་བསྡུ་བ་དང་། ཚར་གཅད་པ་གསང་བ་འམ། ཐེག་པ་ཐ་དད་པ་གསང་བ་འམ། སེམས་ཅན་གྱི་སྤྱོད་པ་དང་། དབང་པོ་རྣམ་པར་ཕྱེ་བ་གསང་བ་འམ། ལས་དང་བྱ་བ་ལ་འཇུག་པ་གསང་བ་འམ། སྤྱོད་པ་དང་མངོན་པར་འཚང་རྒྱ་བའི་རང་བཞིན་བརྗོད་པ་ཐུགས་སུ་ཆུད་པ་གསང་བ་དེ་དག་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེས་རབ་ཏུ་ཤེས་སོ།
en: the secret of the body, the secret of the speech, the secret of the mind, the secret of discerning what is timely and not timely, the secret of prophecies to bodhisattvas, the secret of gathering and subjugating beings, the secret of the different yānas, the secret of the categories of the conduct and capabilities of beings, the secret of the actions and activities of beings, and the secret of understanding the description of the nature of bodhisattva conduct and enlightenment.

source: །གང་འདི་དག་བསྐལ་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་འདི་ལྟ་སྟེ། བསྐལ་པ་གཅིག་ལ་བསྐལ་པ་གྲངས་མེད་པར་ཡང་དག་པར་འཇུག་པ་དང་། གྲངས་མེད་པའི་བསྐལ་པ་ལ་བསྐལ་པ་གཅིག་ཏུ་ཡང་དག་པར་འཇུག་པ་དང་། བསྐལ་པ་གྲངས་མེད་པ་ལ་བསྐལ་པ་གྲངས་མེད་པར་ཡང་དག་པར་འཇུག་པ་དང་། སྐད་ཅིག་ལ་བསྐལ་པ་དང་བསྐལ་པ་ལ་སྐད་ཅིག་ཏུ་ཡང་དག་པར་འཇུག་པ་དང་། བསྐལ་པ་ལ་བསྐལ་པ་མ་ཡིན་པར་ཡང་དག་པར་འཇུག་པ་དང་། བསྐལ་པ་མ་ཡིན་པ་ལ་བསྐལ་པར་ཡང་དག་པར་འཇུག་པ་དང་། སངས་རྒྱས་དང་བཅས་པའི་བསྐལ་པ་སངས་རྒྱས་མེད་པའི་བསྐལ་པར་ཡང་དག་པར་འཇུག་པ་དང་། སངས་རྒྱས་མེད་པའི་བསྐལ་པ་སངས་རྒྱས་དང་བཅས་པའི་བསྐལ་པར་ཡང་དག་པར་འཇུག་པ་དང་། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་བསྐལ་པ་ལ། ད་ལྟར་བྱུང་བ་དང་། འདས་པ་དང་། མ་འོངས་པའི་བསྐལ་པ་འཇུག་ཅིང་། མ་འོངས་པ་དང་འདས་པ་དང་ད་ལྟར་བྱུང་བའི་བསྐལ་པར་ཡང་དག་པར་འཇུག་པ་དང་། བསྐལ་པ་རིང་པོ་ལ་བསྐལ་པ་ཐུང་ངུར་ཡང་དག་པར་འཇུག་པ་དང་། བསྐལ་པ་ཐུང་ངུ་ལ་བསྐལ་པ་རིང་པོར་ཡང་དག་པར་འཇུག་པ་དང་། བསྐལ་པ་ཐམས་ཅད་ལ་མིང་དུ་གདགས་པ་ཡང་དག་པར་འཇུག་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེས་རབ་ཏུ་ཤེས་སོ། །གང་འདི་དག་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཐུགས་སུ་ཆུད་པའི་ཡེ་ཤེས་འདི་ལྟ་སྟེ། སྐྲའི་རྩེ་མོ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། ཞིང་མང་པོ་མངོན་པར་འཚང་རྒྱ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། སེམས་ཅན་གྱི་ལུས་དང་། སེམས་མངོན་པར་འཚང་རྒྱ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། ཐམས་ཅད་དུ་ཁྱབ་པར་མངོན་པར་འཚང་རྒྱ་བ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ།
en: “He has the knowledge of the congruence of eons, which is knowing that countless eons are congruent with one eon, that one eon is congruent with countless eons, that countable eons are congruent with countless eons, that countless eons are congruent with countable eons, that an eon is congruent with one instant of mind, that one instant of mind is congruent with an eon, that an eon is congruent with that which is not an eon, that that which is not an eon is congruent with an eon, that an eon that has buddhas is congruent with an eon that does not have buddhas, that an eon that does not have buddhas is congruent with an eon that does have buddhas, that a past and future eon are congruent with a present eon, that a present eon is congruent with a past and future eon, that a past eon is congruent with a future eon, that a future eon is congruent with a past eon, that a long eon is congruent with a short eon, that a short eon is congruent with a long eon, that a concept is congruent with all eons, and that all eons are congruent with a concept.

source: སྣྲེལ་ཞིའི་སྤྱོད་པ་ལ་འཇུག་པ་ཡང་དག་པར་བསྟན་པའི་ཡེ་ཤེས་སམ། ལུགས་དང་མཐུན་པའི་སྤྱོད་པ་ཡང་དག་པར་བསྟན་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། ལུགས་དང་མྱི་མཐུན་པའི་སྤྱོད་པ་ཡང་དག་པར་བསྟན་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། འཇིག་རྟེན་བསམ་དུ་རུང་བ་དང་། བསམ་དུ་མྱི་རུང་བ་དང་། རྣམ་པར་ཤེས་པར་རུང་བ་དང་། རྣམ་པར་ཤེས་པར་མྱི་རུང་བའི་སྤྱོད་པ་ཡང་དག་པར་བསྟན་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་སམ། ཉན་ཐོས་ཀྱིས་ཤེས་པར་བྱ་བ་དང་རང་སངས་རྒྱས་ཀྱིས་ཤེས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔས་ཤེས་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པས་མཁྱེན་པར་བྱ་བའི་སྤྱོད་པ་ཡང་དག་པར་བསྟན་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་དེ་དག་ཐམས་ཅད་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེས་རབ་ཏུ་ཤེས་སོ།
en: “He has the comprehending wisdom of tathāgata arhat samyak­sambuddhas, which is the wisdom that comprehends the path of childlike beings, the wisdom that comprehends atoms, that wisdom that comprehends attaining enlightenment in a body within buddha realms, the wisdom that comprehends attaining enlightenment in the body and mind of a being, the wisdom that comprehends attaining enlightenment anywhere, the wisdom that comprehends the appearance of contrary conduct, the wisdom that comprehends the appearance of appropriate conduct, the wisdom that comprehends the appearance of inappropriate conduct, the wisdom that comprehends the appearance of conduct that is conceivable and inconceivable and that worldly beings can or cannot know, the wisdom that comprehends the appearance of the conduct that can be known by śrāvakas, that can be known by pratyekabuddhas, that can be known by bodhisattvas, and that can be known by the tathāgatas.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་ཤིན་ཏུ་ཡངས་པ་ཚད་མྱེད་པས། ས་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་ཀྱང་ཚད་མྱེད་དོ།
en: “O jinaputras, in that way the vast wisdom of the buddhas, the bhagavats, is immeasurable, and the comprehending wisdom of the bodhisattva on this bhūmi is also immeasurable.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་འདི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ཞེས་བྱ་བ་རབ་ཏུ་འཐོབ་བོ།
en: “O jinaputras! In that way the bodhisattva who is on this bodhisattva bhūmi attains the bodhisattva liberation called (1) inconceivable

source: །བསྒྲིབས་པ་མྱེད་པ་ཞེས་བྱ་བ་དང་། རྣམ་པར་དག་པ་རབ་ཏུ་འབྱེད་པ་ཞེས་བྱ་བ་དང་། སྒོ་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་མཛོད་ཅེས་བྱ་བ་དང་། འཁོར་ལོ་ཐོགས་པ་མེད་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་དང་། དུས་གསུམ་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་སྣང་བ་ཞེས་བྱ་བ་དང་། ཡུལ་མ་ལུས་པ་ཞེས་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རབ་ཏུ་འཐོབ་བོ།
en: He attains the bodhisattva liberations called ( ) unobscured , (3) pure analysis , (4) the complete illumination of entrances , (5) the treasure of the tathāgatas , (6) possessing the invincible wheel , (7) possessing the three times , (8) the essence of the realm of phenomena , (9) the radiance of the sphere of liberation , and (10) engaging in every realm of experience

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བཅུ་པོ་དེ་དག་ལས་སྩོགས་པ་རྣམ་པར་ཐར་པའི་སྒོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་རབ་ཏུ་འཐོབ་སྟེ།
en: “O jinaputras! In this way the bodhisattva on this tenth bodhisattva bhūmi attains those ten liberations of a bodhisattva, along with countless hundreds of thousands of other entrances to liberation.

source: དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་བརྒྱ་ཕྲག་སྟོང་དང་། གཟུངས་བརྒྱ་ཕྲག་སྟོང་དང་། མངོན་པར་ཤེས་པ་མངོན་པར་བསྒྲུབ་པ་བརྒྱ་ཕྲག་སྟོང་ཡང་རབ་ཏུ་འཐོབ་བོ།
en: Similarly, he attains hundreds of thousands of samādhis, hundreds of thousands of retentions, and hundreds of thousands of clairvoyances.

source: །དེ་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པའི་བློ་དང་ཚད་མྱེད་པ་རྗེས་སུ་སོང་བའི་དྲན་པ་མཁས་པ་དང་ལྡན་པ་ཡིན།
en: “He thus has that kind of wisdom, immeasurable realization, and the skill of memory.
